[{"JobTitle":"Executive Assistant","WorkType":"Excepted Service Permanent","JobSummary":"IMPORTANT NOTICE TO VETERANS CLAIMING PREFERENCE: PLEASE REFER TO THE OTHER INFORMATION SECTION FOR UPDATED INFORMATION ON VETERANS PREFERENCE CRITERIA. Mission Statement The President's Intelligence Advisory Board (PIAB), with its component Intelligence Oversight Board (IOB), is an independent element within the Executive Office of the President. The President's Intelligence Advisory Board exists exclusively to assist the President by providing the President with an independent source of advice on the effectiveness with which the Intelligence Community is meeting the nation's intelligence needs, and the vigor and insight with which the community plans for the future. The Board has access to all information needed to perform its functions and has direct access to the President. The Intelligence Oversight Board oversees the Intelligence Community's compliance with the Constitution and all applicable laws, Executive Orders, and Presidential Directives. It complements and supplements, rather than duplicates the oversight roles of the Director of National Intelligence, Department and Agency Inspectors General and General Counsels, and the Congressional Oversight Committees. For more than five decades the PIAB has acted as a nonpartisan body, offering the President objective, expert advice on the conduct of U.S. intelligence. This position is in the Excepted Service. Excepted Service includes all positions in the executive branch of the Federal Government which are specifically excepted from the competitive service by or pursuant to statute, by the President, or by the Office of Personnel Management, and which are not in the Senior Executive Service. Selection under this appointment authority does not confer civil service competitive status. WHO MAY BE CONSIDERED: This announcement is open to: DEU (public): Open to All U.S. Citizens. If you have never been a federal employee you would apply public. Merit: Open to current and former Federal employees. All current and former Federal employees must submit a copy of your latest SF-50 showing your tenure, grade and step, and type of position occupied (i.e., Excepted or Competitive). All applicants must meet qualifications and eligibility criteria by the closing date of the announcement."},{"JobTitle":"TRAINING TECHNICIAN","WorkType":"Indefinite","JobSummary":"WISCONSIN ARMY NATIONAL GUARD This position is located at: DET 1, Co B, 248th AVSB, West Bend, WI This position is open to current military members of the Wisconsin Army National Guard Military Grade: You must CURRENTLY hold a pay grade of E-1 through E-7, WO-1 through CW-5 or O-1 through O-3 ** EFFECTIVE IMMEDIATELY** OF 306 is a required document for all applications. Failure to include this document will result in removal from consideration. ***If position becomes permanent, individual may be converted to a permanent appointment without further competition. Individual will be given a 30 day notice prior to termination of appointment.*** NATIONAL GUARD MEMBERSHIP IS REQUIRED: This is an excepted position that requires membership in a compatible military assignment in the National Guard. Selectee will be required to wear the military uniform. Acceptance of an excepted position constitutes concurrence with these requirements as a condition of employment. **Acceptance of any military technician position may cause the termination of entitlements and eligibility for all military bonuses and student loan repayments. For further information you must contact the appropriate military education office. **You may lose consideration for the position if your application does not include all the information and/or documents requested on the vacancy announcement. **Veteran's preference does not apply to positions in this agency."},{"JobTitle":"MOBILIZATION READINESS OFFICER","WorkType":"Excepted Service Term","JobSummary":"MOBILIZATION READINESS OFFICER DCSOPS Salem, OR United States 1 vacancy Appointment Type: Excepted Service Term (Indefinite) Official Position Description #: D1815 Series/Grade: GS- 0301- 11 / 12 Salary Range: $61,737.00 - $96,203.00 *Candidates must be able to obtain and maintain a Secret Security Clearance* *Candidates must have a valid state driver's license* *May convert to permanent without further competition* *PCS is not Authorized* MEMBERSHIP IN THE NATIONAL GUARD IS REQUIRED: This is an Excepted Service position that requires membership in the Oregon National Guard as a condition of employment. Selectee will be required to wear the military uniform. Acceptance of an Excepted Service position constitutes concurrence with these requirements as a condition of employment. Unit of military assignment is any supporting unit of DCSOPS. Selectee will be required to participate in the Direct Deposit Electronics Funds Transfer Program. Acceptance of a permanent or indefinite position with the Oregon National Guard will cause termination from any Guard Recruitment Bonus or Guard paid student loan. A law enforcement background check may be required prior to appointment to this position. By submitting a resume or application for this position, you authorize this agency to accomplish the check. This is a dual-status position and membership in the Oregon National Guard is required. By submitting this application you are affirming to the validity of the information you have provided. AREAS OF CONSIDERATION: 1st Area: Current permanent full time support personnel of the Oregon Army National Guard (ARNG) 2nd Area: All members of the Oregon Army National Guard (ARNG) Application materials must be received in our office by Wednesday, March 25, 2015. Failure to provide complete information may result in your not receiving consideration for this position. Please refer to the Qualifications and Evaluations section to understand the qualification requirements, and How To Apply Section for detailed instruction on applying."},{"JobTitle":"Laborer (Temporary)","WorkType":"Temporary - Not to exceed 1039 hours in a service year.","JobSummary":"Reclamation is seeking temporary Laborers to perform repairs and maintenance duties around McCook, Nebraska. You can make a difference in the West by assisting in meeting increasing water demands while protecting the environment. LOCATION: Great Plains Region, Nebraska-Kansas Area Office, Engineering & Infrastructure Services Division, Facility Maintenance Group, McCook, NE. For living conditions go to: www.usbr.gov/gp/employment/living_conditions.pdf Additional vacancies may be filled from this vacancy announcement."},{"JobTitle":"Practical Nurse (Medical Home Port)","WorkType":"Permanent","JobSummary":"This announcement is being used to recruit qualified individuals, under the Office of Personnel Management (OPM) Direct Hire Authority, authorized by 5 United States Code (U.S.C.), Section 3304 and 5 Code of Federal Regulations (CFR) Part 337, Subpart B. The Rule of Three, Veteran's Preference and traditional rating and ranking of applicants do not apply to the Direct Hire process. For more information on OPM Direct-Hire Authority, please review this link: http://www.opm.gov/DirectHire/factsheet.asp . This position is located in the Medical Home Port Team at the Naval Branch Health Clinic, Whiting Field, Milton, Florida."},{"JobTitle":"NUCLEAR ENGINEER","WorkType":"Excepted Service Permanent","JobSummary":"Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here ."},{"JobTitle":"Chaplain (Protestant)","WorkType":"Excepted Service Permanent","JobSummary":"OUR MISSION: To fulfill President Lincoln's promise - \"To care for him who shall have borne the battle, and for his widow, and his orphan\" - by serving and honoring the men and women who are America's Veterans. How would you like to become a part of a team providing compassionate care to Veterans? JOB SUMMARY: This position is for a full-time Protestant Chaplain. The chaplain assesses religious, spiritual, moral, ethical problems and plans and provides appropriate ministration, including individual in-depth pastoral ministry. The chaplain will provide Protestant worship services, sacraments and rituals to meet the needs of Protestant patients. As a member of an interdisciplinary team, the chaplain assures that the needs and desires of patients for religious and spiritual care are addressed in all aspects of the holistic patient-centered care provided by the medical center. For information about the Martinsburg Veterans Medical Center, please click on the link: http://www.martinsburg.va.gov"},{"JobTitle":"Telecommunications Specialist","WorkType":"Permanent","JobSummary":"Telecommunications Specialist Boise, Idaho Appointment Type: Permanent PD #:D1835000 Series/Grade: GS - 0391 - 09 / 11 Salary Range: $48,403.00 - $76,131.00 *Candidates must possess and maintain a Secret Security Clearance* *PCS is not authorized* MEMBERSHIP IN THE AIR NATIONAL GUARD IS REQUIRED: This is an Excepted Service position that requires membership in the Idaho Air National Guard as a condition of employment. Selectee will be required to wear the military uniform. Acceptance of an Excepted Service position constitutes concurrence with these requirements as a condition of employment. Loss of military membership will result in immediate loss of your full-time military technician position. In accordance with the Labor Management Agreement, Article 18, Promotions: Area of Consideration The area of consideration for all Idaho National Guard bargaining unit positions will be as follows: (1) Bargaining unit members (2) All other individuals This does not preclude management from selecting either Section (1) or Section (2) applications after Section (1) applicants have been considered. AREAS OF CONSIDERATION: Current 1C4X1 in the 124th ASOS in the Idaho Air National Guard. THOSE WHO APPLIED UNDER ANNOUNCEMENT #15-069 NEED NOT REAPPLY; YOUR APPLICATIONS WILL BE TAKEN INTO CONSIDERATION. Application materials must be received by Thursday, March 19, 2015 . Failure to provide complete information may result in your not receiving consideration for this position. Please refer to the Qualifications and Evaluations section to understand the requirements."},{"JobTitle":"Regional Transportation Coordinator","WorkType":"Permanent","JobSummary":"This is a full-time PERMANENT position located at the Northeast Regional Office, National Wildlife Refuge System, Division of System Development and Policy in Hadley, MA. Who may be considered? This is a Government-wide recruitment, open to all current career or career-conditional federal employees, former federal employees with reinstatement eligibility, and persons eligible under Federal Special Hire Authorities. Veterans who are preference eligibles or who have been separated from the armed forces under honorable conditions after 3 or more years of continuous active service may apply under the Veterans Employment Opportunity Act (VEOA). Career Transition Assistance Program (CTAP) and Interagency Career Transition Assistance Plan (ICTAP) eligibles within the local commuting area of this vacancy may receive priority consideration. Federal employees must submit a copy of their last, non-award, Notification of Personnel Action (SF50) noting their position title, series, grade and tenure group to verify eligibility as a current, permanent Federal employee. Filing Instructions/Deadline: Completed applications must be received by TAG:Closing Date . There are 2 steps that must be completed. Please read the entire announcement for specific instructions on how to apply. One or more positions may be filled from this vacancy."},{"JobTitle":"Mason","WorkType":"Federal","JobSummary":"This position is located in Building Management Division (BMD) in the Office of Facilities Management and Reliability (OFMR) of the Office of Facilities Engineering and Operations (OFEO). The purpose of this position is to perform a variety of Masonry duties within the assigned opertaional zone. The incumbent may be required to work late shifts, weekends and holidays and is subject to being called in for emergencies to restore the Smithsonian Institution to normal operations."}]